blog/2022/pro-php-and-jquery.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 18:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>深入 PHP 与 jQuery 开发</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">深入 PHP 与 jQuery 开发</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc7e2d7e">1. 第三章：面向对象编程</a>
<ul>
<li><a href="#org8acb141">1.1. 对象和类</a>
<ul>
<li><a href="#orgc8ec23f">1.1.1. 类和对象的差异</a></li>
<li><a href="#org9ba64f9">1.1.2. 创建类</a></li>
<li><a href="#orgcc8a5a1">1.1.3. 定义类属性</a></li>
<li><a href="#org0bb8b26">1.1.4. 定义类方法</a></li>
<li><a href="#orgc43d9ea">1.1.5. 使用类继承</a></li>
<li><a href="#org33c1cb8">1.1.6. 指定属性或方法的可见度</a></li>
<li><a href="#org41ac104">1.1.7. 文档块注释</a></li>
</ul>
</li>
<li><a href="#org9270659">1.2. 面向对象与面向过程的差异</a></li>
</ul>
</li>
<li><a href="#orgdf7098c">2. 第四章：构建活动日程表</a>
<ul>
<li><a href="#orgdad6826">2.1. 规划设计</a>
<ul>
<li><a href="#org4dd8c74">2.1.1. 定义数据库结构</a></li>
<li><a href="#orgb94785b">2.1.2. 创建类映射</a></li>
<li><a href="#org54fd42f">2.1.3. 规划项目的目录结构</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgc7e2d7e" class="outline-2">
<h2 id="orgc7e2d7e"><span class="section-number-2">1</span> 第三章：面向对象编程</h2>
<div class="outline-text-2" id="text-1">
<p>
面向对象编程（OOP）：充分利用代码，将实现同类功能的代码聚合在一起，组织成类。
</p>

<p>
不要重复自己（DRY，Don't repeat yourself）
</p>
</div>

<div id="outline-container-org8acb141" class="outline-3">
<h3 id="org8acb141"><span class="section-number-3">1.1</span> 对象和类</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>类的基础组成</li>
<li>对象和类各自特点</li>
<li>它们的用法</li>
</ul>
</div>

<div id="outline-container-orgc8ec23f" class="outline-4">
<h4 id="orgc8ec23f"><span class="section-number-4">1.1.1</span> 类和对象的差异</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
类，打个比方，就像房子的蓝图。它在纸上清晰地定义了房子的形状，定义了房子各个部分之间的关系，并且计划好了怎么盖，虽然还没盖。
</p>

<p>
对象就像依据蓝图造好的实实在在的房子。在对象中存储的数据就像组成房子的木头、电线和混凝土，在房子没盖起来之前，它们只是一堆东西。然而，当这些东西组装到一起，就成了一座结构完整且实用的房子。
</p>

<p>
<b>数据结构和行为组合到一起构成类，类使用这些信息生成对象。</b> 同一个类同一时间可生成很多对象，每个对象相对于其他对象都是独立的。
</p>

<p>
继续使用盖房子比喻，这类似于用同一张蓝图在一大块地上盖房子：150 套不同的住房，看起来相同，但住着不同的家庭，有着不同的装饰。
</p>
</div>
</div>

<div id="outline-container-org9ba64f9" class="outline-4">
<h4 id="org9ba64f9"><span class="section-number-4">1.1.2</span> 创建类</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
class ClassName
</p>
</div>
</div>

<div id="outline-container-orgcc8a5a1" class="outline-4">
<h4 id="orgcc8a5a1"><span class="section-number-4">1.1.3</span> 定义类属性</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
public $prop1 = "I'm a class property!";
</p>

<p>
箭头（-&gt;）是访问特定对象包含的属性或方法的一个面向对象构造。
</p>
</div>
</div>

<div id="outline-container-org0bb8b26" class="outline-4">
<h4 id="org0bb8b26"><span class="section-number-4">1.1.4</span> 定义类方法</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
方法是只属于某一类的函数。
</p>

<p>
OOP 使对象个体保持独立，代码的不同部分能很容易地分离成较小且相关的包。
</p>

<p>
PHP 还提供了一些特殊方法，简化代码（Magic methods are special methods which override PHP's default's action when certain actions are performed on an object.  from <a href="https://www.php.net/manual/en/language.oop5.magic.php">Magic Methods - PHP Manual</a>）。
</p>

<ol class="org-ol">
<li>构造函数和析构函数</li>
<li>将类输出为字符串</li>
</ol>

<p>
__construct，__destruct，unset，__toString
</p>
</div>
</div>

<div id="outline-container-orgc43d9ea" class="outline-4">
<h4 id="orgc43d9ea"><span class="section-number-4">1.1.5</span> 使用类继承</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
使用 extends 关键字，一个类能够从其他的类继承方法和属性。
</p>

<ol class="org-ol">
<li>覆盖继承来的属性和方法</li>
<li>覆盖时保留被覆盖方法的功能</li>
</ol>
</div>
</div>

<div id="outline-container-org33c1cb8" class="outline-4">
<h4 id="org33c1cb8"><span class="section-number-4">1.1.6</span> 指定属性或方法的可见度</h4>
<div class="outline-text-4" id="text-1-1-6">
<p>
三个可见度关键字：public（公开的），protected（受保护的），private（私有的）
</p>

<p>
还有一种可见度：static（静态的），静态的方法和属性无需创建类的实例就可以访问。
</p>

<p>
为什么没有思考？
</p>
</div>
</div>

<div id="outline-container-org41ac104" class="outline-4">
<h4 id="org41ac104"><span class="section-number-4">1.1.7</span> 文档块注释</h4>
<div class="outline-text-4" id="text-1-1-7">
<div class="org-src-container">
<pre class="src src-php">/**
 * 
 * @author Jim Gao &lt;me@yidajiabei.xyz&gt;
 * @copyright 2022 Jim Gao
 * @license link
 * @var
 * @param
 * @return
 */
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9270659" class="outline-3">
<h3 id="org9270659"><span class="section-number-3">1.2</span> 面向对象与面向过程的差异</h3>
<div class="outline-text-3" id="text-1-2">
<p>
为什么在大项目中，采用面向对象方法？
</p>

<ol class="org-ol">
<li>容易实现</li>
<li>更好的组织</li>
<li>更容易维护</li>
</ol>

<p>
面向过程：
</p>

<div class="org-src-container">
<pre class="src src-php">&lt;?php

function changeJob($person, $newjob)
{
  $person['job'] = $newjob;
  return $person;
}

function happyBirthday($person)
{
  ++$person['age'];
  return $person;
}

$person1 = array(
  'name' =&gt; 'Tom',
  'job' =&gt; 'Button-Pusher',
  'age' =&gt; 34
);

$person2 = array(
  'name' =&gt; 'John',
  'job' =&gt; 'Lever-Pusher',
  'age' =&gt; 42
);

echo "&lt;pre&gt;Person 1: ", print_r($person1, TRUE), "&lt;/pre&gt;";
echo "&lt;pre&gt;Person 2: ", print_r($person2, TRUE), "&lt;/pre&gt;";

$person1 = changeJob($person1, 'Box-Mover');
$person1 = happyBirthday($person1);

$person2 = happyBirthday($person2);

echo "&lt;pre&gt;Person 1: ", print_r($person1, TRUE), "&lt;/pre&gt;";
echo "&lt;pre&gt;Person 2: ", print_r($person2, TRUE), "&lt;/pre&gt;";
</pre>
</div>

<p>
面向对象：
</p>

<div class="org-src-container">
<pre class="src src-php">&lt;?php

class Person
{
  private $_name;
  private $_job;
  private $_age;

  public function __construct($name, $job, $age)
  {
    $this-&gt;_name = $name;
    $this-&gt;_job = $job;
    $this-&gt;_age = $age;
  }

  public function changeJob($newjob)
  {
    $this-&gt;_job = $newjob;
  }

  public function happyBirthday()
  {
    ++$this-&gt;_age;
  }
}

$person1 = new Person("Tom", "Button-Pusher", 34);
$person2 = new Person("John", "Lever Puller", 41);

echo "&lt;pre&gt;Person 1: ", print_r($person1, TRUE), "&lt;/pre&gt;";
echo "&lt;pre&gt;Person 2: ", print_r($person2, TRUE), "&lt;/pre&gt;";

$person1-&gt;changeJob('Box-Mover');
$person1-&gt;happyBirthday();
$person2-&gt;happyBirthday();

echo "&lt;pre&gt;Person 1: ", print_r($person1, TRUE), "&lt;/pre&gt;";
echo "&lt;pre&gt;Person 2: ", print_r($person2, TRUE), "&lt;/pre&gt;";
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdf7098c" class="outline-2">
<h2 id="orgdf7098c"><span class="section-number-2">2</span> 第四章：构建活动日程表</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgdad6826" class="outline-3">
<h3 id="orgdad6826"><span class="section-number-3">2.1</span> 规划设计</h3>
<div class="outline-text-3" id="text-2-1">
<p>
由数据库 MySQL 驱动，先定义数据库结构，后规划网站地图（如何从数据库中获取数据和修改数据）。
</p>
</div>

<div id="outline-container-org4dd8c74" class="outline-4">
<h4 id="org4dd8c74"><span class="section-number-4">2.1.1</span> 定义数据库结构</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
对于一个活动日程表来说，需要存储的信息：
</p>

<ul class="org-ul">
<li>event_id 一个自增长整数，每个活动用该整数唯一标识</li>
<li>event_title 活动标题</li>
<li>event_desc 活动详情</li>
<li>event_start 活动开始时间 格式为：YYYY-MM-DD HH:MM:SS</li>
<li>event_end 活动结束时间 格式同开始时间</li>
</ul>
</div>
</div>

<div id="outline-container-orgb94785b" class="outline-4">
<h4 id="orgb94785b"><span class="section-number-4">2.1.2</span> 创建类映射</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
主类 Calender，负责处理与活动日程表有关的所有行为。方法和属性规划：
</p>

<ul class="org-ul">
<li>构造函数
<ul class="org-ul">
<li>保证数据库连接。若未连接，就创建一个连接</li>
<li>设定以下基本属性：数据库对象</li>
<li>显示当前日期，显示当前月份</li>
<li>显示当前年份</li>
<li>这个月有多少天，这个月的起始日是星期几</li>
</ul></li>
<li>生成活动表单 HTML
<ul class="org-ul">
<li>检查时候正在修改或创建活动</li>
<li>如果是修改活动，把活动数据载入表单</li>
</ul></li>
<li>对用户输入进行安全处理后，将新活动保存到数据库</li>
<li>从数据库删除活动并请求用户确认</li>
<li>载入活动数据
<ul class="org-ul">
<li>从数据库载入活动数据</li>
<li>将指定月份的每个活动按日期保存到一个数组中</li>
</ul></li>
<li>输出日历信息 HTML。循环活动数据数组，并附加相应的标题及时间</li>
<li>用 HTML 显示活动数据并允许通过活动 ID 载入活动描述和详情</li>
</ul>
</div>
</div>

<div id="outline-container-org54fd42f" class="outline-4">
<h4 id="org54fd42f"><span class="section-number-4">2.1.3</span> 规划项目的目录结构</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
出于安全考虑，不要把私密数据放在网站根目录或是公开目录中，其中包括数据库配置文件、程序内核，以及网站运行所需的各个类。
</p>

<p>
需要两个目录：一个公开目录（public），存放供用户直接访问的文件，比如页面、CSS 文件、JavaScript 脚本等；一个是系统目录（sys），存放不易公开的文件，比如数据库账号密码，一些类文件和核心 PHP 文件。
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>